garyPenhook/PyAvrOCD/svd/atmega128rfr2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BOOT_LOAD</name>
      <description>Bootloader</description>
      <baseAddress>0x00800057</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SPMCSR</name>
          <description>Store Program Memory Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPMEN</name>
              <description>Store Program Memory Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGERS</name>
              <description>Page Erase</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGWRT</name>
              <description>Page Write</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLBSET</name>
              <description>Boot Lock Bit Set</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWWSRE</name>
              <description>Read While Write Section Read Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIGRD</name>
              <description>Signature Row Read</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWWSB</name>
              <description>Read While Write Section Busy</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPMIE</name>
              <description>SPM Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU</name>
      <description>CPU Registers</description>
      <baseAddress>0x0080003E</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x15</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1D</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1F</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x23</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x25</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RESET</name>
        <description>External Pin,Power-on Reset,Brown-out Reset,Watchdog Reset,and JTAG AVR Reset. See Datasheet.</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>INT0</name>
        <description>External Interrupt Request 0</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>INT1</name>
        <description>External Interrupt Request 1</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>INT2</name>
        <description>External Interrupt Request 2</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>INT3</name>
        <description>External Interrupt Request 3</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>INT4</name>
        <description>External Interrupt Request 4</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>INT5</name>
        <description>External Interrupt Request 5</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>INT6</name>
        <description>External Interrupt Request 6</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>INT7</name>
        <description>External Interrupt Request 7</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>PCINT0</name>
        <description>Pin Change Interrupt Request 0</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>PCINT1</name>
        <description>Pin Change Interrupt Request 1</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>PCINT2</name>
        <description>Pin Change Interrupt Request 2</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>WDT</name>
        <description>Watchdog Time-out Interrupt</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_COMPA</name>
        <description>Timer/Counter2 Compare Match A</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_COMPB</name>
        <description>Timer/Counter2 Compare Match B</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_OVF</name>
        <description>Timer/Counter2 Overflow</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_CAPT</name>
        <description>Timer/Counter1 Capture Event</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_COMPA</name>
        <description>Timer/Counter1 Compare Match A</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_COMPB</name>
        <description>Timer/Counter1 Compare Match B</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_COMPC</name>
        <description>Timer/Counter1 Compare Match C</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_OVF</name>
        <description>Timer/Counter1 Overflow</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_COMPA</name>
        <description>Timer/Counter0 Compare Match A</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_COMPB</name>
        <description>Timer/Counter0 Compare Match B</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_OVF</name>
        <description>Timer/Counter0 Overflow</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>SPI_STC</name>
        <description>SPI Serial Transfer Complete</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>USART0_RX</name>
        <description>USART0, Rx Complete</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>USART0_UDRE</name>
        <description>USART0 Data register Empty</description>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>USART0_TX</name>
        <description>USART0, Tx Complete</description>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>ANALOG_COMP</name>
        <description>Analog Comparator</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>ADC</name>
        <description>ADC Conversion Complete</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>EE_READY</name>
        <description>EEPROM Ready</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_CAPT</name>
        <description>Timer/Counter3 Capture Event</description>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_COMPA</name>
        <description>Timer/Counter3 Compare Match A</description>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_COMPB</name>
        <description>Timer/Counter3 Compare Match B</description>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_COMPC</name>
        <description>Timer/Counter3 Compare Match C</description>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_OVF</name>
        <description>Timer/Counter3 Overflow</description>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>USART1_RX</name>
        <description>USART1, Rx Complete</description>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>USART1_UDRE</name>
        <description>USART1 Data register Empty</description>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>USART1_TX</name>
        <description>USART1, Tx Complete</description>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>TWI</name>
        <description>2-wire Serial Interface</description>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>SPM_READY</name>
        <description>Store Program Memory Read</description>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>TIMER4_CAPT</name>
        <description>Timer/Counter4 Capture Event</description>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>TIMER4_COMPA</name>
        <description>Timer/Counter4 Compare Match A</description>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>TIMER4_COMPB</name>
        <description>Timer/Counter4 Compare Match B</description>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>TIMER4_COMPC</name>
        <description>Timer/Counter4 Compare Match C</description>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>TIMER4_OVF</name>
        <description>Timer/Counter4 Overflow</description>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>TIMER5_CAPT</name>
        <description>Timer/Counter5 Capture Event</description>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>TIMER5_COMPA</name>
        <description>Timer/Counter5 Compare Match A</description>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>TIMER5_COMPB</name>
        <description>Timer/Counter5 Compare Match B</description>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>TIMER5_COMPC</name>
        <description>Timer/Counter5 Compare Match C</description>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>TIMER5_OVF</name>
        <description>Timer/Counter5 Overflow</description>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>TRX24_PLL_LOCK</name>
        <description>TRX24 - PLL lock interrupt</description>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>TRX24_PLL_UNLOCK</name>
        <description>TRX24 - PLL unlock interrupt</description>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>TRX24_RX_START</name>
        <description>TRX24 - Receive start interrupt</description>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>TRX24_RX_END</name>
        <description>TRX24 - RX_END interrupt</description>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>TRX24_CCA_ED_DONE</name>
        <description>TRX24 - CCA/ED done interrupt</description>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>TRX24_XAH_AMI</name>
        <description>TRX24 - XAH - AMI</description>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>TRX24_TX_END</name>
        <description>TRX24 - TX_END interrupt</description>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>TRX24_AWAKE</name>
        <description>TRX24 AWAKE - transceiver is reaching state TRX_OFF</description>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>SCNT_CMP1</name>
        <description>Symbol counter - compare match 1 interrupt</description>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>SCNT_CMP2</name>
        <description>Symbol counter - compare match 2 interrupt</description>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>SCNT_CMP3</name>
        <description>Symbol counter - compare match 3 interrupt</description>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>SCNT_OVFL</name>
        <description>Symbol counter - overflow interrupt</description>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>SCNT_BACKOFF</name>
        <description>Symbol counter - backoff interrupt</description>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>AES_READY</name>
        <description>AES engine ready interrupt</description>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>BAT_LOW</name>
        <description>Battery monitor indicates supply voltage below threshold</description>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>TRX24_TX_START</name>
        <description>TRX24 TX start interrupt</description>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>TRX24_AMI0</name>
        <description>Address match interrupt of address filter 0</description>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>TRX24_AMI1</name>
        <description>Address match interrupt of address filter 1</description>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>TRX24_AMI2</name>
        <description>Address match interrupt of address filter 2</description>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>TRX24_AMI3</name>
        <description>Address match interrupt of address filter 3</description>
        <value>76</value>
      </interrupt>
      <registers>
        <register>
          <name>CLKPR</name>
          <description>Clock Prescale Register</description>
          <addressOffset>0x23</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKPS</name>
              <description>Clock Prescaler Select Bits</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVISION_FACTOR_1_RC_OSCILLATOR_2</name>
                  <description>Division factor 1   / RC-Oscillator   2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVISION_FACTOR_2_RC_OSCILLATOR_4</name>
                  <description>Division factor 2   / RC-Oscillator   4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVISION_FACTOR_4_RC_OSCILLATOR_8</name>
                  <description>Division factor 4   / RC-Oscillator   8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVISION_FACTOR_8_RC_OSCILLATOR_16</name>
                  <description>Division factor 8   / RC-Oscillator  16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVISION_FACTOR_16_RC_OSCILLATOR_32</name>
                  <description>Division factor 16  / RC-Oscillator  32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVISION_FACTOR_32_RC_OSCILLATOR_64</name>
                  <description>Division factor 32  / RC-Oscillator  64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVISION_FACTOR_64_RC_OSCILLATOR_128</name>
                  <description>Division factor 64  / RC-Oscillator 128</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVISION_FACTOR_128_RC_OSCILLATOR_256</name>
                  <description>Division factor 128 / RC-Oscillator 256</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVISION_FACTOR_256_RC_OSCILLATOR_512</name>
                  <description>Division factor 256 / RC-Oscillator 512</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>Reserved</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVISION_FACTOR_1_ONLY_PERMITTED_FOR_RC_OSCILLATOR_FLASH_AND_EEPROM_PROGRAMMING_IS_NOT_ALLOWED</name>
                  <description>Division factor 1 only permitted for RC-Oscillator. Flash and EEPROM programming is not allowed.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKPCE</name>
              <description>Clock Prescaler Change Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOR0</name>
          <description>General Purpose IO Register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPIOR00</name>
              <description>General Purpose I/O Register 0 Value</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOR01</name>
              <description>General Purpose I/O Register 0 Value</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOR02</name>
              <description>General Purpose I/O Register 0 Value</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOR03</name>
              <description>General Purpose I/O Register 0 Value</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOR04</name>
              <description>General Purpose I/O Register 0 Value</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOR05</name>
              <description>General Purpose I/O Register 0 Value</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOR06</name>
              <description>General Purpose I/O Register 0 Value</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOR07</name>
              <description>General Purpose I/O Register 0 Value</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOR1</name>
          <description>General Purpose IO Register 1</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPIOR</name>
              <description>General Purpose I/O Register 1 Value</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOR2</name>
          <description>General Purpose I/O Register 2</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPIOR</name>
              <description>General Purpose I/O Register 2 Value</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUCR</name>
          <description>MCU Control Register</description>
          <addressOffset>0x17</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IVCE</name>
              <description>Interrupt Vector Change Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IVSEL</name>
              <description>Interrupt Vector Select</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PUD</name>
              <description>Pull-up Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>JTD</name>
              <description>JTAG Interface Disable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
