garyPenhook/PyAvrOCD/svd/atmega128rfr2.svd
        <register>
          <name>CSMA_SEED_0</name>
          <description>Transceiver CSMA-CA Random Number Generator Seed Register</description>
          <addressOffset>0xAF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSMA_SEED_00</name>
              <description>Seed Value for CSMA Random Number Generator</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSMA_SEED_01</name>
              <description>Seed Value for CSMA Random Number Generator</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSMA_SEED_02</name>
              <description>Seed Value for CSMA Random Number Generator</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSMA_SEED_03</name>
              <description>Seed Value for CSMA Random Number Generator</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSMA_SEED_04</name>
              <description>Seed Value for CSMA Random Number Generator</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSMA_SEED_05</name>
              <description>Seed Value for CSMA Random Number Generator</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSMA_SEED_06</name>
              <description>Seed Value for CSMA Random Number Generator</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSMA_SEED_07</name>
              <description>Seed Value for CSMA Random Number Generator</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSMA_SEED_1</name>
          <description>Transceiver Acknowledgment Frame Control Register 2</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSMA_SEED_1</name>
              <description>Seed Value for CSMA Random Number Generator</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AACK_I_AM_COORD</name>
              <description>Set Personal Area Network Coordinator</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AACK_DIS_ACK</name>
              <description>Disable Acknowledgment Frame Transmission</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AACK_SET_PD</name>
              <description>Set Frame Pending Sub-field</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AACK_FVN_MODE</name>
              <description>Acknowledgment Frame Filter Mode</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACKNOWLEDGE_FRAMES_WITH_VERSION_NUMBER_0</name>
                  <description>Acknowledge frames with version number 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACKNOWLEDGE_FRAMES_WITH_VERSION_NUMBER_0_OR_1</name>
                  <description>Acknowledge frames with version number 0 or 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACKNOWLEDGE_FRAMES_WITH_VERSION_NUMBER_0_OR_1_OR_2</name>
                  <description>Acknowledge frames with version number 0 or 1 or 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACKNOWLEDGE_FRAMES_INDEPENDENT_OF_FRAME_VERSION_NUMBER</name>
                  <description>Acknowledge frames independent of frame version number</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FTN_CTRL</name>
          <description>Transceiver Filter Tuning Control Register</description>
          <addressOffset>0x9A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FTN_START</name>
              <description>Start Calibration Loop of Filter Tuning Network</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_ADDR_0</name>
          <description>Transceiver MAC IEEE Address Register 0</description>
          <addressOffset>0xA6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IEEE_ADDR_00</name>
              <description>MAC IEEE Address</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IEEE_ADDR_01</name>
              <description>MAC IEEE Address</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IEEE_ADDR_02</name>
              <description>MAC IEEE Address</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IEEE_ADDR_03</name>
              <description>MAC IEEE Address</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IEEE_ADDR_04</name>
              <description>MAC IEEE Address</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IEEE_ADDR_05</name>
              <description>MAC IEEE Address</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IEEE_ADDR_06</name>
              <description>MAC IEEE Address</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IEEE_ADDR_07</name>
              <description>MAC IEEE Address</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_ADDR_1</name>
          <description>Transceiver MAC IEEE Address Register 1</description>
          <addressOffset>0xA7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IEEE_ADDR_</name>
              <description>MAC IEEE Address</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_ADDR_2</name>
          <description>Transceiver MAC IEEE Address Register 2</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IEEE_ADDR_</name>
              <description>MAC IEEE Address</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_ADDR_3</name>
          <description>Transceiver MAC IEEE Address Register 3</description>
          <addressOffset>0xA9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IEEE_ADDR_</name>
              <description>MAC IEEE Address</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_ADDR_4</name>
          <description>Transceiver MAC IEEE Address Register 4</description>
          <addressOffset>0xAA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IEEE_ADDR_</name>
              <description>MAC IEEE Address</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_ADDR_5</name>
          <description>Transceiver MAC IEEE Address Register 5</description>
          <addressOffset>0xAB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IEEE_ADDR_</name>
              <description>MAC IEEE Address</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_ADDR_6</name>
          <description>Transceiver MAC IEEE Address Register 6</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IEEE_ADDR_</name>
              <description>MAC IEEE Address</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_ADDR_7</name>
          <description>Transceiver MAC IEEE Address Register 7</description>
          <addressOffset>0xAD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IEEE_ADDR_</name>
              <description>MAC IEEE Address</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_MASK</name>
          <description>Transceiver Interrupt Enable Register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLL_LOCK_EN</name>
              <description>PLL Lock Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_UNLOCK_EN</name>
              <description>PLL Unlock Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_START_EN</name>
              <description>RX_START Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_END_EN</name>
              <description>RX_END Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCA_ED_DONE_EN</name>
              <description>End of ED Measurement Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AMI_EN</name>
              <description>Address Match Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_END_EN</name>
              <description>TX_END Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AWAKE_EN</name>
              <description>Awake Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_MASK1</name>
          <description>Transceiver Interrupt Enable Register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TX_START_EN</name>
              <description>Transmit Start Interrupt enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAF_0_AMI_EN</name>
              <description>Address Match Interrupt enable Address filter 0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAF_1_AMI_EN</name>
              <description>Address Match Interrupt enable Address filter 1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAF_2_AMI_EN</name>
              <description>Address Match Interrupt enable Address filter 2</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAF_3_AMI_EN</name>
              <description>Address Match Interrupt enable Address filter 3</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Res</name>
              <description>Reserved Bit</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_STATUS</name>
          <description>Transceiver Interrupt Status Register</description>
          <addressOffset>0x91</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLL_LOCK</name>
              <description>PLL Lock Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_UNLOCK</name>
              <description>PLL Unlock Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_START</name>
              <description>RX_START Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_END</name>
              <description>RX_END Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCA_ED_DONE</name>
              <description>End of ED Measurement Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AMI</name>
              <description>Address Match Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_END</name>
              <description>TX_END Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AWAKE</name>
              <description>Awake Interrupt Status</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_STATUS1</name>
          <description>Transceiver Interrupt Status Register 1</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TX_START</name>
              <description>Transmit Start Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAF_0_AMI</name>
              <description>Address Match Interrupt Status Address filter 0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAF_1_AMI</name>
              <description>Address Match Interrupt Status Address filter 1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAF_2_AMI</name>
              <description>Address Match Interrupt Status Address filter 2</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAF_3_AMI</name>
              <description>Address Match Interrupt Status Address filter 3</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Res</name>
              <description>Reserved Bit</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MAFCR0</name>
          <description>Multiple Address Filter Configuration Register 0</description>
          <addressOffset>0x4E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAF0EN</name>
              <description>Multiple Address Filter 0 Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAF1EN</name>
              <description>Multiple Address Filter 1 Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAF2EN</name>
              <description>Multiple Address Filter 2 Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAF3EN</name>
              <description>Multiple Address Filter 3 Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Res</name>
              <description>Reserved Bit</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
